tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "omnisharp/omnisharp-roslyn"
tap "terrastruct/tap"
brew "bat"
brew "sqlite"
brew "d2"
brew "libpq", link: true
brew "diesel"
brew "dotnet"
brew "elixir"
brew "eza"
brew "fd"
brew "flyctl"
brew "fzf"
brew "gcc"
brew "ghc"
brew "ghcup"
brew "go"
brew "handbrake"
brew "haskell-language-server"
brew "haskell-stack"
brew "node"
brew "http-server"
brew "iperf3"
brew "jupyterlab"
brew "just"
brew "lazygit"
brew "neovim"
brew "nmap"
brew "nvm"
brew "opam"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "php"
brew "pkg-config"
brew "pnpm"
brew "pyenv"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "wget"
brew "yarn"
cask "alacritty"
cask "android-studio"
cask "arc"
cask "autodesk-fusion"
cask "balenaetcher"
cask "basictex"
cask "brave-browser"
cask "curseforge"
cask "datagrip"
cask "discord"
cask "docker"
cask "figma"
cask "flutter"
cask "handbrake"
cask "insomnia"
cask "minecraft"
cask "ngrok"
cask "openemu"
cask "orion"
cask "prismlauncher"
cask "prusaslicer"
cask "raycast"
cask "signal"
cask "spotify"
cask "tailscale"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vnc-viewer"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "alexisvt.flutter-snippets"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "denoland.vscode-deno"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "humao.rest-client"
vscode "irongeek.vscode-env"
vscode "jakebecker.elixir-ls"
vscode "justusadam.language-haskell"
vscode "kevinrose.vsc-python-indent"
vscode "kevlanche.jastadd-syntax-highlighting"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robertz.code-snapshot"
vscode "rust-lang.rust-analyzer"
vscode "saratravi.elixir-formatter"
vscode "serayuzgur.crates"
vscode "sleistner.vscode-fileutils"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "terrastruct.d2"
vscode "theumletteam.umlet"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-java-debug"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
