tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "autopep8"
brew "bat"
brew "cocoapods"
brew "libpq", link: true
brew "diesel"
brew "elixir"
brew "node"
brew "eslint"
brew "eza"
brew "fd"
brew "flake8"
brew "flyctl"
brew "fzf"
brew "gcc"
brew "go"
brew "ios-deploy"
brew "jupyterlab"
brew "just"
brew "libimobiledevice"
brew "luarocks"
brew "neovim"
brew "nmap"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "pnpm"
brew "prettier"
brew "ripgrep"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "tmux"
brew "watchman"
brew "wget"
brew "xcodegen"
brew "yarn"
brew "zig"
brew "zls"
cask "android-studio"
cask "brave-browser"
cask "curseforge"
cask "datagrip"
cask "discord"
cask "docker"
cask "figma"
cask "flutter"
cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "minecraft"
cask "ngrok"
cask "openemu"
cask "orion"
cask "prismlauncher"
cask "raycast"
cask "signal"
cask "spotify"
cask "tailscale"
cask "visual-studio-code"
cask "vnc-viewer"
cask "warp"
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "alexisvt.flutter-snippets"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "denoland.vscode-deno"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "Gimly81.matlab"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "IronGeek.vscode-env"
vscode "JakeBecker.elixir-ls"
vscode "johnbillion.vscode-wordpress-hooks"
vscode "Kevlanche.jastadd-syntax-highlighting"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "otovo-oss.htmx-tags"
vscode "Prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "robertz.code-snapshot"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "skellock.just"
vscode "sleistner.vscode-fileutils"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wix.vscode-import-cost"
vscode "ziglang.vscode-zig"
