tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "planetscale/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line client for the Drone continuous integration server
brew "drone-cli"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# C websockets server library
brew "libwebsockets"
# Make/rake-like build tool using Go
brew "mage"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Open source relational database management system
brew "mysql-client"
# Utility for managing network connections
brew "netcat"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm", link: false
# Object-relational database system
brew "postgresql@14"
# Ruby version manager
brew "rbenv"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Android SDK component
cask "android-platform-tools"
cask "android-sdk"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Compatibility layer to run Windows applications
cask "wine-stable"
